Repository: quarkusio/es.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en
Languages: es_es

source: We need to add an extension to our project to build container images via the Quarkus Maven plugin:
es_es: Necesitamos añadir una extensión a nuestro proyecto para construir imágenes de contenedores a través del plugin de Quarkus Maven:

source: We pre-boot as many of the frameworks as possible during the native compilation of a Quarkus application. It means that the resulting native executable has already run most of the startup code and serialized the result into the executable: even faster startup!
es_es: Pre-arrancamos tantos frameworks como sea posible durante la compilación nativa de una aplicación Quarkus. Esto significa que el ejecutable nativo resultante ya ha ejecutado la mayor parte del código de arranque y ha serializado el resultado en el ejecutable: ¡un arranque aún más rápido!

source: We really liked the fact that Quarkus uses JAX-RS, which we were already familiar with. Having out-of-the-box integration with https://quarkus.io/guides/resteasy-reactive[RESTEasy reactive^] was a nice performance bonus, and the https://quarkus.io/guides/openapi-swaggerui[OpenAPI extension^] available in Quarkus made it pretty simple to expose the API as a Swagger API browser with no additional work needed.
es_es: Nos gustó mucho el hecho de que Quarkus utiliza JAX-RS, con el que ya estábamos familiarizados. Tener una integración inmediata con https://quarkus.io/guides/resteasy-reactive[RESTEasy reactivo^] fue un buen bono de rendimiento, y la https://quarkus.io/guides/openapi-swaggerui[extensión OpenAPI^] disponible en Quarkus hizo que fuera bastante simple exponer la API como un navegador de API Swagger sin necesidad de trabajo adicional.

source: We recommend that you follow the instructions in the next sections and create the application step by step.
es_es: Le recomendamos que siga las instrucciones de las siguientes secciones y cree la aplicación paso a paso.

source: We released Quarkus 3.3.1, our first maintenance release for our 3.3 release train.
es_es: Lanzamos Quarkus 3.3.1, nuestra primera versión de mantenimiento para nuestro tren de lanzamiento 3.3.

source: We value your feedback a lot so please report bugs, ask for improvements... Let's build something great together!
es_es: Valoramos mucho tus comentarios, así que por favor reporta errores, solicita mejoras... ¡Construyamos algo grandioso juntos!

source: We will deploy a web application so we need to configure the type `web` in the Heroku `Procfile` like this:
es_es: Vamos a desplegar una aplicación web por lo que necesitamos configurar el tipo `web` en el Heroku `Procfile` así:

source: Weekly Builds
es_es: Construcciones semanales

source: Welcome to the Quarkus World Tour.
es_es: Bienvenido al Quarkus World Tour.

source: What Makes Quarkus Different?
es_es: ¿Qué hace diferente a Quarkus?

source: What are the extension statuses?
es_es: ¿Cuáles son los estados de las extensiones?

source: What does it mean to be a Kubernetes-native framework?
es_es: ¿Qué significa ser un marco nativo de Kubernetes?

source: What is Quarkus?
es_es: ¿Qué es Quarkus?

source: What is a Quarkus extension?
es_es: ¿Qué es una extensión de Quarkus?

source: What is augmentation?
es_es: ¿Qué es el proceso de aumento?

source: What is your license?
es_es: ¿Qué licencia tiene?

source: What we mean by "Supersonic Subatomic Java".
es_es: Que queremos decir con "Supersonic Subatomic Java".

source: What's next?
es_es: ¿Qué es lo que sigue?

source: What’s Next for Adoptium
es_es: Lo que viene para Adoptium

source: When Quarkus was designed, we didn’t focus only on containers but also on deploying Quarkus applications on container orchestrators such as Kubernetes. Quarkus build-time processing also generates the Kubernetes metadata, so your application is ready to be deployed on Kubernetes. Runtime capabilities such as health checks and metrics are exposed out of the box. Quarkus collects all the required metadata at build time to create the Kubernetes deployment descriptor and produce a container image. A single command line can deploy your application onto your Kubernetes cluster.
es_es: Cuando se diseñó Quarkus, no nos centramos únicamente en los contenedores, sino también en el despliegue de aplicaciones Quarkus en orquestadores de contenedores como Kubernetes. El procesamiento en tiempo de construcción de Quarkus también genera los metadatos de Kubernetes, por lo que su aplicación está lista para ser desplegada en Kubernetes. Las capacidades de tiempo de ejecución, como las comprobaciones de salud y las métricas, están expuestas de forma inmediata. Quarkus recoge todos los metadatos necesarios en tiempo de construcción para crear el descriptor de despliegue de Kubernetes y producir una imagen de contenedor. Una sola línea de comandos puede desplegar su aplicación en su clúster de Kubernetes.

source: When a native executable is created (explained in detail xref:building-native-image.adoc[here]), it is *always* built from a production application.
es_es: Cuando se crea un ejecutable nativo (explicado en detalle xref:building-native-image.html[aquí]), *siempre* se construye a partir de una aplicación de producción.

source: When is re-augmentation useful?
es_es: ¿Cuándo es útil la re-aumentación?

source: When using the buildpack container image extension it is strongly advised to avoid adding `quarkus.container-image.build=true` in your properties configuration as it might trigger nesting builds within builds. It's preferable to pass it as an option to the build command instead.
es_es: Cuando se utiliza la extensión de la imagen del contenedor buildpack se recomienda encarecidamente evitar añadir `quarkus.container-image.build=true` en la configuración de las propiedades, ya que podría desencadenar construcciones anidadas dentro de otras. Es preferible pasarla como una opción al comando de construcción.

source: When using the repository pattern, you can define your entities as regular POJO.
es_es: Cuando se utiliza el patrón de repositorio, se pueden definir las entidades como POJO normales.

source: When xDS is configured, `plain-text` is automatically disabled.
es_es: Cuando se configura xDS, `plain-text` se desactiva automáticamente.

source: When xDS target property is used, name resolver, host, and port are not used
es_es: Cuando se utiliza la propiedad de destino xDS, no se utilizan los datos de resolución de nombres, host y puerto

source: When you have multiple connectors, you would need to indicate which connector you want to use in the application configuration.
es_es: Si tiene varios conectores, deberá indicar qué conector desea utilizar en la configuración de la aplicación.

source: Where can I get it?
es_es: ¿Dónde puedo conseguirlo?

source: Whether AMQP subscription is durable Type: _boolean_
es_es: Si la suscripción AMQP es duradera Type: _boolean_

source: Whether sent AMQP messages are marked durable Type: _boolean_
es_es: Si los mensajes AMQP enviados se marcan como duraderos Type: _boolean_

source: Whether the AMQP connection uses SSL/TLS Type: _boolean_
es_es: Si la conexión AMQP utiliza SSL/TLS Type: _boolean_

source: Whether the connector should allow multiple upstreams Type: _boolean_
es_es: Si el conector debe permitir múltiples flujos ascendentes Type: _boolean_

source: Whether the received AMQP messages must be acknowledged when received Type: _boolean_
es_es: Si los mensajes AMQP recibidos deben ser acusados de recibo Type: _boolean_

source: Whether the received AMQP messages must be dispatched to multiple _subscribers_ Type: _boolean_
es_es: Si los mensajes AMQP recibidos deben ser enviados a múltiples _suscriptores_ Type: _boolean_

source: Whether tracing is enabled (default) or disabled Type: _boolean_
es_es: Si el rastreo está activado (por defecto) o desactivado Type: _boolean_

source: While Quarkus by default runs on port 8080, most Azure services expect web applications to be running on port 80. Before we continue, go back to your quickstart code and open the file `src/main/docker/Dockerfile.native`.
es_es: Aunque Quarkus se ejecuta por defecto en el puerto 8080, la mayoría de los servicios de Azure esperan que las aplicaciones web se ejecuten en el puerto 80. Antes de continuar, vuelve a tu código de inicio rápido y abre el archivo `src/main/docker/Dockerfile.native`.

source: While developers can download distributions directly from the https://adoptium.net/[Adoptium website^] with a single click, it becomes more of a challenge to automate this process, for example in a CI/CD pipeline. This is especially true due to the number of variants of Java versions, release types, operating systems, architectures, JVM implementations, etc. To that end, Adoptium needed to offer a way to programmatically discover and access pre-built binaries based on these variables, and produced https://api.adoptium.net/q/swagger-ui/[an end-user API^].
es_es: Mientras que los desarrolladores pueden descargar las distribuciones directamente desde el https://adoptium.net/[sitio web de Adoptium^] con un solo clic, resulta más complicado automatizar este proceso, por ejemplo, en una canalización CI/CD. Esto es especialmente cierto debido a la cantidad de variantes de versiones de Java, tipos de distribución, sistemas operativos, arquitecturas, implementaciones de JVM, etc. Para ello, Adoptium necesitaba ofrecer una forma de descubrir y acceder mediante programación a los binarios preconstruidos en función de estas variables, y produjo https://api.adoptium.net/q/swagger-ui/[una API para el usuario final^].

source: Why follow this process
es_es: Por qué seguir este proceso

source: Will the Quarkus team accept my extension?
es_es: ¿El equipo de Quarkus aceptará mi extensión?

source: With <a href="https://code.quarkus.io/">code.quarkus.io</a>, in a few clicks, you can bootstrap your Quarkus application and discover its extension ecosystem.
es_es: Con <a href="https://code.quarkus.io/">code.quarkus.io</a> en unos pocos clics, puedes arrancar tu aplicación Quarkus y descubrir su ecosistema de extensiones.

source: With Docker installed, you can now push the image and release it:
es_es: Con Docker instalado, ahora puedes empujar la imagen y liberarla:

source: With Funqy, a function is just:
es_es: Con Funqy, una función es simplemente:

source: With Panache, the <code>Element</code> class would be as simple as:
es_es: Con Panache, la clase <code>Element</code> sería tan simple como:

source: With the *Kafka Dev UI*, you can directly manage your Kafka cluster and perform tasks, such as:
es_es: Con *Kafka Dev UI*, puede gestionar directamente su clúster Kafka y realizar tareas, como:

source: Wizards w/code.quarkus.io
es_es: Hechiceros w/code.quarkus.io

source: Working with multi-module project or external modules
es_es: Trabajar con un proyecto multimodal o con módulos externos

source: Works with Quarkus 1.1.1
es_es: Funciona con Quarkus 1.1.1

source: Write New Extensions
es_es: Crear nuevas extensiones

source: Write QuickStart Guides
es_es: Escribir guías de inicio rápido

source: Write Your First Application
es_es: Escriba su primera aplicación

source: Write a Spring Data Application
es_es: Escribir una aplicación de datos de Spring

source: Writing JSON REST services
es_es: Escribir servicios JSON REST

source: Yes, we consider Quarkus stable. Remember 95% of the features Quarkus apps use are provided by the ecosystem like Hibernate ORM, Eclipse Vert.x, Netty, RESTEasy, etc. These libraries are rock solid :)
es_es: Sí, consideramos que Quarkus es estable. Recuerde que el 95 % de las funciones que usan las aplicaciones de Quarkus las proporciona el ecosistema como Hibernate ORM, Eclipse Vert.x, Netty, RESTEasy, etc. Estas bibliotecas son sólidas como una roca :)

source: You also need to add the following at the top of your `settings.gradle` file:
es_es: También debe añadir lo siguiente en la parte superior de su archivo `settings.gradle`:

source: You can `create` your function using the following command:
es_es: Puede crear su función utilizando el siguiente comando, `create` :

source: You can add the extension to your project using:
es_es: Puede añadir la extensión a su proyecto utilizando:

source: You can also deploy the container image as a microservice in a Kubernetes cluster on Azure. To do that, follow this tutorial:
es_es: También puedes desplegar la imagen del contenedor como un microservicio en un clúster de Kubernetes en Azure. Para ello, sigue este tutorial:

source: You can also provide duration values starting with a number. In this case, if the value consists only of a number, the converter treats the value as seconds. Otherwise, `PT` is implicitly prepended to the value to obtain a standard `java.time.Duration` format.
es_es: También puede proporcionar valores de duración que empiecen por un número. En este caso, si el valor consiste sólo en un número, el conversor trata el valor como segundos. En caso contrario, `PT` se antepone implícitamente al valor para obtener un formato estándar `java.time.Duration`.

source: You can also run the test from your IDE directly (be sure you stopped the application first).
es_es: También puede ejecutar la prueba desde su IDE directamente (asegúrese de detener la aplicación primero).

source: You can also use this to configure the current user that the test will run as:
es_es: También puede utilizarlo para configurar el usuario actual con el que se ejecutará la prueba:

source: You can and should check the logs to see if your application is now indeed running from the container:
es_es: Puede y debe comprobar los registros para ver si su aplicación se está ejecutando desde el contenedor:

source: You can configure the AMQP address using the `address` attribute:
es_es: Puedes configurar la dirección AMQP utilizando el atributo `address`:

source: You can configure timeout for Kafka admin client calls used in topic creation using `quarkus.kafka.devservices.topic-partitions-timeout`, it defaults to 2 seconds.
es_es: Puede configurar el tiempo de espera para las llamadas del cliente Kafka admin utilizadas en la creación de temas utilizando `quarkus.kafka.devservices.topic-partitions-timeout`, por defecto es de 2 segundos.

source: You can customize the underlying client configuration by producing an instance of `AmqpClientOptions` as follows:
es_es: Puede personalizar la configuración del cliente subyacente produciendo una instancia de `AmqpClientOptions` de la siguiente manera:

source: You can download it via Maven using the following command:
es_es: Puede descargarlo a través de Maven utilizando el siguiente comando:

source: You can find more information about how to deploy the application in Kubernetes in the xref:deploying-to-kubernetes.adoc#deployment[the Kubernetes guide].
es_es: Puede encontrar más información sobre cómo desplegar la aplicación en Kubernetes en xref:deploying-to-kubernetes.adoc#deployment[la guía de Kubernetes].

source: You can find the extension status on https://code.quarkus.io[code.quarkus.io] or in the extension link:/guides/[guides].
es_es: Puede encontrar el estado de la extensión en https://code.quarkus.io[code.quarkus.io] o en las link:/guides/[guías] de la extensión.

source: You can get a better understanding on how to use this extension in the Quarkus Guides.
es_es: Puede obtener una mejor comprensión de cómo utilizar esta extensión en las Guías de Quarkus.

source: You can get https://github.com/quarkusio/quarkus/releases/tag/3.3.1[the full changelog of 3.3.1 on GitHub].
es_es: Puedes consultar el https://github.com/quarkusio/quarkus/releases/tag/3.3.1[registro completo de cambios 3.3.1 en GitHub].

source: You can go to https://code.quarkus.io/[code.quarkus.io] to see if a particular extension is _stable_ (default) or _preview_.
es_es: Puedes ir a https://code.quarkus.io/[code.quarkus.io] para ver si una extensión en particular es _stable_ (default) o _preview_.

source: You can of course create a native image using the instructions of the xref:building-native-image.adoc[Building a native executable guide].
es_es: Por supuesto, puedes crear una imagen nativa siguiendo las instrucciones de la xref:building-native-image.html[guía Construir un ejecutable nativo].

source: You can receive it using a `JsonObject`
es_es: Puede recibirlo mediante un `JsonObject`

source: You can run the application using: `java -jar target/quarkus-app/quarkus-run.jar`
es_es: Puedes ejecutar la aplicación con: `java -jar target/quarkus-app/quarkus-run.jar`

source: You can run these using Maven:
es_es: Puedes ejecutarlas con Maven:

source: You can then call your endpoints via:
es_es: A continuación, puede llamar a sus endpoints a través de:

source: You can use any of the Quarkus features in your function and benefit from the fast startup and low memory utilization. With Quarkus, you can embrace this new world without having to change your programming language.
es_es: Puede utilizar cualquiera de las características de Quarkus en su función y beneficiarse de la rápida puesta en marcha y la baja utilización de la memoria. Con Quarkus, puedes abrazar este nuevo mundo sin tener que cambiar tu lenguaje de programación.

source: You can use the JPA entity manager directly. Panache proposes an alternative removing boilerplate and exposing an active record and repository models.
es_es: Se puede utilizar el gestor de entidades JPA directamente. Panache propone una alternativa eliminando el boilerplate y exponiendo un registro activo y modelos de repositorio.

source: You can use xref:security-properties.adoc[quarkus-elytron-security-properties-file] for testing security. This supports both embedding user info in `application.properties` and standalone properties files.
es_es: Puedes usar xref:security-properties.html[quarkus-elytron-security-properties-file] para probar la seguridad. Esto soporta tanto la introducción de la información del usuario en `application.properties` como los archivos de propiedades independientes.

source: You have found nowhere.<br/>The pathway to normal space<br/>is found in the nav.
es_es: No has encontrado ningún lugar.<br/>El camino hacia el espacio normal<br/>se encuentra en el menu.

source: You just need to run both applications using:
es_es: Sólo tienes que ejecutar ambas aplicaciones utilizando:

source: You may delete the directory `quarkus-app/lib/deployment` to save some space in your ZIP distribution or Docker image (remember to use a multistage Docker build to avoid unnecessary layers). After deleting the `deployment` directory, it is obviously not possible anymore to re-augment the application.
es_es: Puedes eliminar el directorio `quarkus-app/lib/deployment` para ahorrar algo de espacio en tu distribución ZIP o imagen Docker (recuerda utilizar una construcción Docker multietapa para evitar capas innecesarias). Después de eliminar el directorio `deployment`, obviamente ya no es posible volver a aumentar la aplicación.

source: You may need to configure the `link-name` attribute, if the queue name is not the channel name:
es_es: Es posible que tenga que configurar el atributo `link-name`, si el nombre de la cola no es el nombre del canal:

source: You might need to wait a couple of seconds until the curler pod comes up. Run the following to get bash access to the curler pod:
es_es: Puede que tengas que esperar un par de segundos hasta que aparezca el pod. Ejecute lo siguiente para obtener acceso bash al pod:

source: You need <a href="https://en.wikipedia.org/wiki/Comparison_of_integrated_development_environments#Java" target="_blank">an IDE</a> like <a href="https://www.jetbrains.com/idea/download/">IntelliJ IDEA</a>, <a href="https://www.eclipse.org/downloads/">Eclipse</a>, <a href="https://code.visualstudio.com/Download">VSCode</a> or even <a href="https://spacevim.org/use-vim-as-a-java-ide/">Vim</a> or <a href="http://spacemacs.org">Emacs</a>!
es_es: Necesita <a href="https://en.wikipedia.org/wiki/Comparison_of_integrated_development_environments#Java" target="_blank">un IDE</a> como <a href="https://www.jetbrains.com/idea/download/">IntelliJ IDEA</a>, <a href="https://www.eclipse.org/downloads/">Eclipse</a>, <a href="https://code.visualstudio.com/Download">VSCode</a> o incluso <a href="https://spacevim.org/use-vim-as-a-java-ide/">Vim</a> o <a href="http://spacemacs.org">Emacs</a>!

source: You need <a href="https://maven.apache.org/" target="_blank">Apache Maven {{ site.data.versions.maven }}</a>
es_es: Necesitas <a href="https://maven.apache.org/" target="_blank">Apache Maven {{ site.data.versions.maven }}</a>

source: You need <a href="https://maven.apache.org/" target="_blank">Apache Maven {{ site.data.versions.maven }}</a> or <a href="https://gradle.org/" target="_blank">Gradle</a>
es_es: Necesitas <a href="https://maven.apache.org/" target="_blank">Apache Maven {{ site.data.versions.maven }}</a> o <a href="https://gradle.org/" target="_blank">Gradle</a>

source: You need a <a href="https://adoptopenjdk.net" target="_blank">a JDK {{ site.data.versions.jdk }}</a> (any distribution)
es_es: Necesita un <a href="https://adoptopenjdk.net" target="_blank">JDK {{ site.data.versions.jdk }}</a> (cualquier distribución)

source: You need the following configuration:
es_es: Necesita la siguiente configuración:

source: You will now be in a shell within the Kubernetes cluster. Within the shell, execute this curl command , the broker address is an example and might differ based on your project or broker name.
es_es: Ahora estarás en un shell dentro del cluster de Kubernetes. Dentro del shell, ejecute este comando curl , la dirección del broker es un ejemplo y puede diferir según el nombre de su proyecto o broker.

source: Your application should already be runnable via `heroku local web`.
es_es: Su aplicación ya debería poder ejecutarse a través de `heroku local web`.

source: Your container image is now ready to run on Azure. Remember, the Quarkus application is mapped to run on port 80.
es_es: Tu imagen de contenedor está ahora lista para ejecutarse en Azure. Recuerde que la aplicación Quarkus está mapeada para ejecutarse en el puerto 80.

source: Your endpoints will be available on http://localhost:8080.
es_es: Sus endpoints estarán disponibles en http://localhost:8080.

source: Your help is more than welcome! Don’t hesitate to join the crowd.
es_es: Tu ayuda es más que bienvenida. No dudes en unirte a la multitud.

source: Your implemented provider must be a CDI bean. Here's an example:
es_es: Su proveedor implementado debe ser un bean CDI. He aquí un ejemplo:

source: Zero config, live reload in the blink of an eye
es_es: Sin configuración, recarga en vivo en un abrir y cerrar de ojos

source: [b] - Toggle 'broken only' mode, where only failing tests are run
es_es: [b] - Activar el modo "sólo fallidas", en el que sólo se ejecutan las pruebas que fallan

source: [f] - Re-run failed tests
es_es: [f] - Volver a ejecutar las pruebas fallidas

source: [i] - Toggle instrumentation based reload
es_es: [i] - Activar la recarga basada en la instrumentación

source: [l] - Toggle live reload
es_es: [l] - Activar la recarga en vivo

source: [o] - Toggle test output
es_es: [o] - Conmutar la salida de la prueba

source: [p] - Pause tests
es_es: [p] - Pausa de las pruebas

source: [r] - Re-run all tests
es_es: [r] - Volver a ejecutar todas las pruebas

source: [s] - Force restart
es_es: [s] - Forzar el reinicio

source: [v] - Print failures from the last test run
es_es: [v] - Imprime los fallos de la última prueba realizada

source: `10`: best compression (can be slow for big files)
es_es: `10`Mejor compresión (puede ser lenta para archivos grandes)

source: `1`: faster compression
es_es: `1`: compresión más rápida

source: `9`: better compression
es_es: `9`: mejor compresión
